Duet3D/Duet3Expansion/src/atmel/SAMC20_DFP/1.1.95/Atmel.SAMC20_DFP.pdsc
      <condition id="ATSAMC20N18A">
         <require Dvendor="Atmel:3" Dname="ATSAMC20N18A"/>
         <require Cclass="CMSIS" Cgroup="CORE"/>
      </condition>
      <condition id="ATSAMC20J15A">
         <require Dvendor="Atmel:3" Dname="ATSAMC20J15A"/>
         <require Cclass="CMSIS" Cgroup="CORE"/>
      </condition>
      <condition id="ATSAMC20G18A">
         <require Dvendor="Atmel:3" Dname="ATSAMC20G18A"/>
         <require Cclass="CMSIS" Cgroup="CORE"/>
      </condition>
      <condition id="ATSAMC20J17AU">
         <require Dvendor="Atmel:3" Dname="ATSAMC20J17AU"/>
         <require Cclass="CMSIS" Cgroup="CORE"/>
      </condition>
      <condition id="ATSAMC20J16A">
         <require Dvendor="Atmel:3" Dname="ATSAMC20J16A"/>
         <require Cclass="CMSIS" Cgroup="CORE"/>
      </condition>
      <condition id="ATSAMC20J17A">
         <require Dvendor="Atmel:3" Dname="ATSAMC20J17A"/>
         <require Cclass="CMSIS" Cgroup="CORE"/>
      </condition>
      <condition id="ATSAMC20E16A">
         <require Dvendor="Atmel:3" Dname="ATSAMC20E16A"/>
         <require Cclass="CMSIS" Cgroup="CORE"/>
      </condition>
      <condition id="ATSAMC20J18AU">
         <require Dvendor="Atmel:3" Dname="ATSAMC20J18AU"/>
         <require Cclass="CMSIS" Cgroup="CORE"/>
      </condition>
      <condition id="ATSAMC20N17A">
         <require Dvendor="Atmel:3" Dname="ATSAMC20N17A"/>
         <require Cclass="CMSIS" Cgroup="CORE"/>
      </condition>
      <condition id="ATSAMC20E18A">
         <require Dvendor="Atmel:3" Dname="ATSAMC20E18A"/>
         <require Cclass="CMSIS" Cgroup="CORE"/>
      </condition>
      <condition id="ATSAMC20E17A">
         <require Dvendor="Atmel:3" Dname="ATSAMC20E17A"/>
         <require Cclass="CMSIS" Cgroup="CORE"/>
      </condition>
      <condition id="ATSAMC20E15A">
         <require Dvendor="Atmel:3" Dname="ATSAMC20E15A"/>
         <require Cclass="CMSIS" Cgroup="CORE"/>
      </condition>
      <condition id="ATSAMC20G15A">
         <require Dvendor="Atmel:3" Dname="ATSAMC20G15A"/>
         <require Cclass="CMSIS" Cgroup="CORE"/>
      </condition>
   </conditions>
   <components>
      <component Cvendor="Atmel"
                 Cclass="Device"
                 Cgroup="Startup"
                 Cversion="1.1.0"
                 condition="ATSAMC20G17A">
         <description>Headers and startup code for Atmel ATSAMC20G17A</description>
         <files>
            <file condition="C" category="include" name="samc20/include"/>
            <file condition="C" category="header" name="samc20/include/sam.h"/>
            <file condition="C Exe"
                  category="source"
                  name="samc20/templates/main.c"
                  attr="template"
                  select="Main file (.c)"/>
            <file condition="C Exe"
                  category="source"
                  name="samc20/templates/main.cpp"
                  attr="template"
                  select="Main file (.cpp)"/>
            <file condition="C Lib"
                  category="source"
                  name="samc20/templates/library.c"
                  attr="template"
                  select="Main file (.c)"/>
            <file condition="C Lib"
                  category="source"
                  name="samc20/templates/library.cpp"
                  attr="template"
                  select="Main file (.cpp)"/>
            <file condition="GCC Exe"
                  category="source"
                  name="samc20/gcc/system_samc20.c"
                  attr="config"/>
            <file condition="GCC Exe"
                  category="source"
                  name="samc20/gcc/gcc/startup_samc20.c"
                  attr="config"/>
            <file condition="GCC Exe"
                  category="linkerScript"
                  name="samc20/gcc/gcc/samc20g17a_flash.ld"
                  attr="config"/>
            <file condition="GCC Exe"
                  category="other"
                  name="samc20/gcc/gcc/samc20g17a_sram.ld"
                  attr="config"/>
            <file condition="ARMCC Exe"
                  category="source"
                  name="samc20/armcc/Device/SAMC20/Source/ARM/startup_SAMC20.s"
                  attr="config"/>
            <file condition="ARMCC Exe"
                  category="source"
                  name="samc20/armcc/Device/SAMC20/Source/system_samc20.c"
                  attr="config"/>
            <file condition="IAR Exe"
                  category="source"
                  name="samc20/iar/system_samc20.c"
                  attr="config"/>
            <file condition="IAR Exe"
                  category="source"
                  name="samc20/iar/iar/startup_samc20.c"
                  attr="config"/>
            <file condition="IAR Exe"
                  category="linkerScript"
                  name="samc20/iar/iar/samc20g17a_flash.icf"
                  attr="config"/>
            <file condition="IAR Exe"
                  category="other"
                  name="samc20/iar/iar/samc20g17a_sram.icf"
                  attr="config"/>
         </files>
      </component>
      <component Cvendor="Atmel"
                 Cclass="Device"
                 Cgroup="Startup"
                 Cversion="1.1.0"
                 condition="ATSAMC20G16A">
         <description>Headers and startup code for Atmel ATSAMC20G16A</description>
         <files>
            <file condition="C" category="include" name="samc20/include"/>
            <file condition="C" category="header" name="samc20/include/sam.h"/>
            <file condition="C Exe"
                  category="source"
                  name="samc20/templates/main.c"
                  attr="template"
                  select="Main file (.c)"/>
            <file condition="C Exe"
                  category="source"
                  name="samc20/templates/main.cpp"
                  attr="template"
                  select="Main file (.cpp)"/>
            <file condition="C Lib"
                  category="source"
                  name="samc20/templates/library.c"
                  attr="template"
                  select="Main file (.c)"/>
            <file condition="C Lib"
                  category="source"
                  name="samc20/templates/library.cpp"
                  attr="template"
                  select="Main file (.cpp)"/>
            <file condition="GCC Exe"
                  category="source"
                  name="samc20/gcc/system_samc20.c"
                  attr="config"/>
            <file condition="GCC Exe"
                  category="source"
                  name="samc20/gcc/gcc/startup_samc20.c"
                  attr="config"/>
            <file condition="GCC Exe"
                  category="linkerScript"
                  name="samc20/gcc/gcc/samc20g16a_flash.ld"
                  attr="config"/>
            <file condition="GCC Exe"
                  category="other"
                  name="samc20/gcc/gcc/samc20g16a_sram.ld"
                  attr="config"/>
            <file condition="ARMCC Exe"
                  category="source"
                  name="samc20/armcc/Device/SAMC20/Source/ARM/startup_SAMC20.s"
                  attr="config"/>
            <file condition="ARMCC Exe"
                  category="source"
                  name="samc20/armcc/Device/SAMC20/Source/system_samc20.c"
                  attr="config"/>
            <file condition="IAR Exe"
                  category="source"
                  name="samc20/iar/system_samc20.c"
                  attr="config"/>
            <file condition="IAR Exe"
                  category="source"
                  name="samc20/iar/iar/startup_samc20.c"
                  attr="config"/>
            <file condition="IAR Exe"
                  category="linkerScript"
                  name="samc20/iar/iar/samc20g16a_flash.icf"
                  attr="config"/>
            <file condition="IAR Exe"
                  category="other"
                  name="samc20/iar/iar/samc20g16a_sram.icf"
                  attr="config"/>
         </files>
      </component>
      <component Cvendor="Atmel"
                 Cclass="Device"
                 Cgroup="Startup"
                 Cversion="1.1.0"
                 condition="ATSAMC20J18A">
         <description>Headers and startup code for Atmel ATSAMC20J18A</description>
         <files>
            <file condition="C" category="include" name="samc20/include"/>
            <file condition="C" category="header" name="samc20/include/sam.h"/>
            <file condition="C Exe"
                  category="source"
                  name="samc20/templates/main.c"
                  attr="template"
                  select="Main file (.c)"/>
            <file condition="C Exe"
                  category="source"
                  name="samc20/templates/main.cpp"
                  attr="template"
                  select="Main file (.cpp)"/>
            <file condition="C Lib"
                  category="source"
                  name="samc20/templates/library.c"
                  attr="template"
                  select="Main file (.c)"/>
            <file condition="C Lib"
                  category="source"
                  name="samc20/templates/library.cpp"
                  attr="template"
                  select="Main file (.cpp)"/>
            <file condition="GCC Exe"
                  category="source"
                  name="samc20/gcc/system_samc20.c"
                  attr="config"/>
            <file condition="GCC Exe"
                  category="source"
                  name="samc20/gcc/gcc/startup_samc20.c"
                  attr="config"/>
            <file condition="GCC Exe"
                  category="linkerScript"
                  name="samc20/gcc/gcc/samc20j18a_flash.ld"
                  attr="config"/>
            <file condition="GCC Exe"
                  category="other"
                  name="samc20/gcc/gcc/samc20j18a_sram.ld"
                  attr="config"/>
            <file condition="ARMCC Exe"
                  category="source"
                  name="samc20/armcc/Device/SAMC20/Source/ARM/startup_SAMC20.s"
                  attr="config"/>
            <file condition="ARMCC Exe"
                  category="source"
                  name="samc20/armcc/Device/SAMC20/Source/system_samc20.c"
                  attr="config"/>
            <file condition="IAR Exe"
                  category="source"
                  name="samc20/iar/system_samc20.c"
                  attr="config"/>
            <file condition="IAR Exe"
                  category="source"
                  name="samc20/iar/iar/startup_samc20.c"
                  attr="config"/>
            <file condition="IAR Exe"
                  category="linkerScript"
                  name="samc20/iar/iar/samc20j18a_flash.icf"
                  attr="config"/>
            <file condition="IAR Exe"
                  category="other"
                  name="samc20/iar/iar/samc20j18a_sram.icf"
                  attr="config"/>
         </files>
      </component>
      <component Cvendor="Atmel"
                 Cclass="Device"
                 Cgroup="Startup"
                 Cversion="1.1.0"
                 condition="ATSAMC20N18A">
         <description>Headers and startup code for Atmel ATSAMC20N18A</description>
         <files>
            <file condition="C" category="include" name="samc20n/include"/>
            <file condition="C" category="header" name="samc20n/include/sam.h"/>
            <file condition="C Exe"
                  category="source"
                  name="samc20n/templates/main.c"
                  attr="template"
                  select="Main file (.c)"/>
            <file condition="C Exe"
                  category="source"
                  name="samc20n/templates/main.cpp"
                  attr="template"
                  select="Main file (.cpp)"/>
            <file condition="C Lib"
                  category="source"
                  name="samc20n/templates/library.c"
                  attr="template"
                  select="Main file (.c)"/>
            <file condition="C Lib"
                  category="source"
                  name="samc20n/templates/library.cpp"
                  attr="template"
                  select="Main file (.cpp)"/>
            <file condition="GCC Exe"
                  category="source"
                  name="samc20n/gcc/system_samc20.c"
                  attr="config"/>
            <file condition="GCC Exe"
                  category="source"
                  name="samc20n/gcc/gcc/startup_samc20.c"
                  attr="config"/>
            <file condition="GCC Exe"
                  category="linkerScript"
                  name="samc20n/gcc/gcc/samc20n18a_flash.ld"
                  attr="config"/>
            <file condition="GCC Exe"
                  category="other"
                  name="samc20n/gcc/gcc/samc20n18a_sram.ld"
                  attr="config"/>
            <file condition="IAR Exe"
                  category="source"
                  name="samc20n/iar/system_samc20.c"
                  attr="config"/>
            <file condition="IAR Exe"
                  category="source"
                  name="samc20n/iar/iar/startup_samc20.c"
                  attr="config"/>
            <file condition="IAR Exe"
                  category="linkerScript"
                  name="samc20n/iar/iar/samc20n18a_flash.icf"
                  attr="config"/>
            <file condition="IAR Exe"
                  category="other"
                  name="samc20n/iar/iar/samc20n18a_sram.icf"
                  attr="config"/>
         </files>
      </component>
      <component Cvendor="Atmel"
                 Cclass="Device"
                 Cgroup="Startup"
                 Cversion="1.1.0"
                 condition="ATSAMC20J15A">
         <description>Headers and startup code for Atmel ATSAMC20J15A</description>
         <files>
            <file condition="C" category="include" name="samc20/include"/>
            <file condition="C" category="header" name="samc20/include/sam.h"/>
            <file condition="C Exe"
                  category="source"
                  name="samc20/templates/main.c"
                  attr="template"
                  select="Main file (.c)"/>
            <file condition="C Exe"
                  category="source"
                  name="samc20/templates/main.cpp"
                  attr="template"
                  select="Main file (.cpp)"/>
            <file condition="C Lib"
                  category="source"
                  name="samc20/templates/library.c"
                  attr="template"
                  select="Main file (.c)"/>
            <file condition="C Lib"
                  category="source"
                  name="samc20/templates/library.cpp"
                  attr="template"
                  select="Main file (.cpp)"/>
            <file condition="GCC Exe"
                  category="source"
                  name="samc20/gcc/system_samc20.c"
                  attr="config"/>
            <file condition="GCC Exe"
                  category="source"
                  name="samc20/gcc/gcc/startup_samc20.c"
                  attr="config"/>
            <file condition="GCC Exe"
                  category="linkerScript"
                  name="samc20/gcc/gcc/samc20j15a_flash.ld"
                  attr="config"/>
            <file condition="GCC Exe"
                  category="other"
                  name="samc20/gcc/gcc/samc20j15a_sram.ld"
                  attr="config"/>
            <file condition="IAR Exe"
                  category="source"
                  name="samc20/iar/system_samc20.c"
                  attr="config"/>
            <file condition="IAR Exe"
                  category="source"
                  name="samc20/iar/iar/startup_samc20.c"
                  attr="config"/>
            <file condition="IAR Exe"
                  category="linkerScript"
                  name="samc20/iar/iar/samc20j15a_flash.icf"
                  attr="config"/>
            <file condition="IAR Exe"
                  category="other"
                  name="samc20/iar/iar/samc20j15a_sram.icf"
                  attr="config"/>
         </files>
      </component>
      <component Cvendor="Atmel"
                 Cclass="Device"
                 Cgroup="Startup"
                 Cversion="1.1.0"
                 condition="ATSAMC20G18A">
         <description>Headers and startup code for Atmel ATSAMC20G18A</description>
         <files>
            <file condition="C" category="include" name="samc20/include"/>
            <file condition="C" category="header" name="samc20/include/sam.h"/>
            <file condition="C Exe"
                  category="source"
                  name="samc20/templates/main.c"
                  attr="template"
                  select="Main file (.c)"/>
            <file condition="C Exe"
                  category="source"
                  name="samc20/templates/main.cpp"
                  attr="template"
                  select="Main file (.cpp)"/>
            <file condition="C Lib"
                  category="source"
                  name="samc20/templates/library.c"
                  attr="template"
                  select="Main file (.c)"/>
            <file condition="C Lib"
                  category="source"
                  name="samc20/templates/library.cpp"
                  attr="template"
                  select="Main file (.cpp)"/>
            <file condition="GCC Exe"
                  category="source"
                  name="samc20/gcc/system_samc20.c"
                  attr="config"/>
            <file condition="GCC Exe"
                  category="source"
                  name="samc20/gcc/gcc/startup_samc20.c"
                  attr="config"/>
            <file condition="GCC Exe"
                  category="linkerScript"
                  name="samc20/gcc/gcc/samc20g18a_flash.ld"
                  attr="config"/>
            <file condition="GCC Exe"
                  category="other"
                  name="samc20/gcc/gcc/samc20g18a_sram.ld"
                  attr="config"/>
            <file condition="ARMCC Exe"
                  category="source"
                  name="samc20/armcc/Device/SAMC20/Source/ARM/startup_SAMC20.s"
                  attr="config"/>
            <file condition="ARMCC Exe"
                  category="source"
                  name="samc20/armcc/Device/SAMC20/Source/system_samc20.c"
                  attr="config"/>
            <file condition="IAR Exe"
                  category="source"
                  name="samc20/iar/system_samc20.c"
                  attr="config"/>
            <file condition="IAR Exe"
                  category="source"
                  name="samc20/iar/iar/startup_samc20.c"
                  attr="config"/>
            <file condition="IAR Exe"
                  category="linkerScript"
                  name="samc20/iar/iar/samc20g18a_flash.icf"
                  attr="config"/>
            <file condition="IAR Exe"
                  category="other"
                  name="samc20/iar/iar/samc20g18a_sram.icf"
                  attr="config"/>
         </files>
      </component>
      <component Cvendor="Atmel"
                 Cclass="Device"
                 Cgroup="Startup"
                 Cversion="1.1.0"
                 condition="ATSAMC20J17AU">
         <description>Headers and startup code for Atmel ATSAMC20J17AU</description>
         <files>
            <file condition="C" category="include" name="samc20/include"/>
            <file condition="C" category="header" name="samc20/include/sam.h"/>
            <file condition="C Exe"
                  category="source"
                  name="samc20/templates/main.c"
                  attr="template"
                  select="Main file (.c)"/>
            <file condition="C Exe"
                  category="source"
                  name="samc20/templates/main.cpp"
                  attr="template"
                  select="Main file (.cpp)"/>
            <file condition="C Lib"
                  category="source"
                  name="samc20/templates/library.c"
                  attr="template"
                  select="Main file (.c)"/>
            <file condition="C Lib"
                  category="source"
                  name="samc20/templates/library.cpp"
                  attr="template"
                  select="Main file (.cpp)"/>
            <file condition="GCC Exe"
                  category="source"
                  name="samc20/gcc/system_samc20.c"
                  attr="config"/>
            <file condition="GCC Exe"
                  category="source"
                  name="samc20/gcc/gcc/startup_samc20.c"
                  attr="config"/>
            <file condition="GCC Exe"
                  category="linkerScript"
                  name="samc20/gcc/gcc/samc20j17au_flash.ld"
                  attr="config"/>
            <file condition="GCC Exe"
                  category="other"
                  name="samc20/gcc/gcc/samc20j17au_sram.ld"
                  attr="config"/>
            <file condition="IAR Exe"
                  category="source"
                  name="samc20/iar/system_samc20.c"
                  attr="config"/>
            <file condition="IAR Exe"
                  category="source"
                  name="samc20/iar/iar/startup_samc20.c"
                  attr="config"/>
            <file condition="IAR Exe"
                  category="linkerScript"
                  name="samc20/iar/iar/samc20j17au_flash.icf"
                  attr="config"/>
            <file condition="IAR Exe"
                  category="other"
                  name="samc20/iar/iar/samc20j17au_sram.icf"
                  attr="config"/>
         </files>
      </component>
