Duet3D/Duet3Expansion/src/atmel/SAMC20_DFP/1.1.95/Atmel.SAMC20_DFP.pdsc
      <component Cvendor="Atmel"
                 Cclass="Device"
                 Cgroup="Startup"
                 Cversion="1.1.0"
                 condition="ATSAMC20J16A">
         <description>Headers and startup code for Atmel ATSAMC20J16A</description>
         <files>
            <file condition="C" category="include" name="samc20/include"/>
            <file condition="C" category="header" name="samc20/include/sam.h"/>
            <file condition="C Exe"
                  category="source"
                  name="samc20/templates/main.c"
                  attr="template"
                  select="Main file (.c)"/>
            <file condition="C Exe"
                  category="source"
                  name="samc20/templates/main.cpp"
                  attr="template"
                  select="Main file (.cpp)"/>
            <file condition="C Lib"
                  category="source"
                  name="samc20/templates/library.c"
                  attr="template"
                  select="Main file (.c)"/>
            <file condition="C Lib"
                  category="source"
                  name="samc20/templates/library.cpp"
                  attr="template"
                  select="Main file (.cpp)"/>
            <file condition="GCC Exe"
                  category="source"
                  name="samc20/gcc/system_samc20.c"
                  attr="config"/>
            <file condition="GCC Exe"
                  category="source"
                  name="samc20/gcc/gcc/startup_samc20.c"
                  attr="config"/>
            <file condition="GCC Exe"
                  category="linkerScript"
                  name="samc20/gcc/gcc/samc20j16a_flash.ld"
                  attr="config"/>
            <file condition="GCC Exe"
                  category="other"
                  name="samc20/gcc/gcc/samc20j16a_sram.ld"
                  attr="config"/>
            <file condition="ARMCC Exe"
                  category="source"
                  name="samc20/armcc/Device/SAMC20/Source/ARM/startup_SAMC20.s"
                  attr="config"/>
            <file condition="ARMCC Exe"
                  category="source"
                  name="samc20/armcc/Device/SAMC20/Source/system_samc20.c"
                  attr="config"/>
            <file condition="IAR Exe"
                  category="source"
                  name="samc20/iar/system_samc20.c"
                  attr="config"/>
            <file condition="IAR Exe"
                  category="source"
                  name="samc20/iar/iar/startup_samc20.c"
                  attr="config"/>
            <file condition="IAR Exe"
                  category="linkerScript"
                  name="samc20/iar/iar/samc20j16a_flash.icf"
                  attr="config"/>
            <file condition="IAR Exe"
                  category="other"
                  name="samc20/iar/iar/samc20j16a_sram.icf"
                  attr="config"/>
         </files>
      </component>
      <component Cvendor="Atmel"
                 Cclass="Device"
                 Cgroup="Startup"
                 Cversion="1.1.0"
                 condition="ATSAMC20J17A">
         <description>Headers and startup code for Atmel ATSAMC20J17A</description>
         <files>
            <file condition="C" category="include" name="samc20/include"/>
            <file condition="C" category="header" name="samc20/include/sam.h"/>
            <file condition="C Exe"
                  category="source"
                  name="samc20/templates/main.c"
                  attr="template"
                  select="Main file (.c)"/>
            <file condition="C Exe"
                  category="source"
                  name="samc20/templates/main.cpp"
                  attr="template"
                  select="Main file (.cpp)"/>
            <file condition="C Lib"
                  category="source"
                  name="samc20/templates/library.c"
                  attr="template"
                  select="Main file (.c)"/>
            <file condition="C Lib"
                  category="source"
                  name="samc20/templates/library.cpp"
                  attr="template"
                  select="Main file (.cpp)"/>
            <file condition="GCC Exe"
                  category="source"
                  name="samc20/gcc/system_samc20.c"
                  attr="config"/>
            <file condition="GCC Exe"
                  category="source"
                  name="samc20/gcc/gcc/startup_samc20.c"
                  attr="config"/>
            <file condition="GCC Exe"
                  category="linkerScript"
                  name="samc20/gcc/gcc/samc20j17a_flash.ld"
                  attr="config"/>
            <file condition="GCC Exe"
                  category="other"
                  name="samc20/gcc/gcc/samc20j17a_sram.ld"
                  attr="config"/>
            <file condition="ARMCC Exe"
                  category="source"
                  name="samc20/armcc/Device/SAMC20/Source/ARM/startup_SAMC20.s"
                  attr="config"/>
            <file condition="ARMCC Exe"
                  category="source"
                  name="samc20/armcc/Device/SAMC20/Source/system_samc20.c"
                  attr="config"/>
            <file condition="IAR Exe"
                  category="source"
                  name="samc20/iar/system_samc20.c"
                  attr="config"/>
            <file condition="IAR Exe"
                  category="source"
                  name="samc20/iar/iar/startup_samc20.c"
                  attr="config"/>
            <file condition="IAR Exe"
                  category="linkerScript"
                  name="samc20/iar/iar/samc20j17a_flash.icf"
                  attr="config"/>
            <file condition="IAR Exe"
                  category="other"
                  name="samc20/iar/iar/samc20j17a_sram.icf"
                  attr="config"/>
         </files>
      </component>
      <component Cvendor="Atmel"
                 Cclass="Device"
                 Cgroup="Startup"
                 Cversion="1.1.0"
                 condition="ATSAMC20E16A">
         <description>Headers and startup code for Atmel ATSAMC20E16A</description>
         <files>
            <file condition="C" category="include" name="samc20/include"/>
            <file condition="C" category="header" name="samc20/include/sam.h"/>
            <file condition="C Exe"
                  category="source"
                  name="samc20/templates/main.c"
                  attr="template"
                  select="Main file (.c)"/>
            <file condition="C Exe"
                  category="source"
                  name="samc20/templates/main.cpp"
                  attr="template"
                  select="Main file (.cpp)"/>
            <file condition="C Lib"
                  category="source"
                  name="samc20/templates/library.c"
                  attr="template"
                  select="Main file (.c)"/>
            <file condition="C Lib"
                  category="source"
                  name="samc20/templates/library.cpp"
                  attr="template"
                  select="Main file (.cpp)"/>
            <file condition="GCC Exe"
                  category="source"
                  name="samc20/gcc/system_samc20.c"
                  attr="config"/>
            <file condition="GCC Exe"
                  category="source"
                  name="samc20/gcc/gcc/startup_samc20.c"
                  attr="config"/>
            <file condition="GCC Exe"
                  category="linkerScript"
                  name="samc20/gcc/gcc/samc20e16a_flash.ld"
                  attr="config"/>
            <file condition="GCC Exe"
                  category="other"
                  name="samc20/gcc/gcc/samc20e16a_sram.ld"
                  attr="config"/>
            <file condition="ARMCC Exe"
                  category="source"
                  name="samc20/armcc/Device/SAMC20/Source/ARM/startup_SAMC20.s"
                  attr="config"/>
            <file condition="ARMCC Exe"
                  category="source"
                  name="samc20/armcc/Device/SAMC20/Source/system_samc20.c"
                  attr="config"/>
            <file condition="IAR Exe"
                  category="source"
                  name="samc20/iar/system_samc20.c"
                  attr="config"/>
            <file condition="IAR Exe"
                  category="source"
                  name="samc20/iar/iar/startup_samc20.c"
                  attr="config"/>
            <file condition="IAR Exe"
                  category="linkerScript"
                  name="samc20/iar/iar/samc20e16a_flash.icf"
                  attr="config"/>
            <file condition="IAR Exe"
                  category="other"
                  name="samc20/iar/iar/samc20e16a_sram.icf"
                  attr="config"/>
         </files>
      </component>
      <component Cvendor="Atmel"
                 Cclass="Device"
                 Cgroup="Startup"
                 Cversion="1.1.0"
                 condition="ATSAMC20J18AU">
         <description>Headers and startup code for Atmel ATSAMC20J18AU</description>
         <files>
            <file condition="C" category="include" name="samc20/include"/>
            <file condition="C" category="header" name="samc20/include/sam.h"/>
            <file condition="C Exe"
                  category="source"
                  name="samc20/templates/main.c"
                  attr="template"
                  select="Main file (.c)"/>
            <file condition="C Exe"
                  category="source"
                  name="samc20/templates/main.cpp"
                  attr="template"
                  select="Main file (.cpp)"/>
            <file condition="C Lib"
                  category="source"
                  name="samc20/templates/library.c"
                  attr="template"
                  select="Main file (.c)"/>
            <file condition="C Lib"
                  category="source"
                  name="samc20/templates/library.cpp"
                  attr="template"
                  select="Main file (.cpp)"/>
            <file condition="GCC Exe"
                  category="source"
                  name="samc20/gcc/system_samc20.c"
                  attr="config"/>
            <file condition="GCC Exe"
                  category="source"
                  name="samc20/gcc/gcc/startup_samc20.c"
                  attr="config"/>
            <file condition="GCC Exe"
                  category="linkerScript"
                  name="samc20/gcc/gcc/samc20j18au_flash.ld"
                  attr="config"/>
            <file condition="GCC Exe"
                  category="other"
                  name="samc20/gcc/gcc/samc20j18au_sram.ld"
                  attr="config"/>
            <file condition="IAR Exe"
                  category="source"
                  name="samc20/iar/system_samc20.c"
                  attr="config"/>
            <file condition="IAR Exe"
                  category="source"
                  name="samc20/iar/iar/startup_samc20.c"
                  attr="config"/>
            <file condition="IAR Exe"
                  category="linkerScript"
                  name="samc20/iar/iar/samc20j18au_flash.icf"
                  attr="config"/>
            <file condition="IAR Exe"
                  category="other"
                  name="samc20/iar/iar/samc20j18au_sram.icf"
                  attr="config"/>
         </files>
      </component>
      <component Cvendor="Atmel"
                 Cclass="Device"
                 Cgroup="Startup"
                 Cversion="1.1.0"
                 condition="ATSAMC20N17A">
         <description>Headers and startup code for Atmel ATSAMC20N17A</description>
         <files>
            <file condition="C" category="include" name="samc20n/include"/>
            <file condition="C" category="header" name="samc20n/include/sam.h"/>
            <file condition="C Exe"
                  category="source"
                  name="samc20n/templates/main.c"
                  attr="template"
                  select="Main file (.c)"/>
            <file condition="C Exe"
                  category="source"
                  name="samc20n/templates/main.cpp"
                  attr="template"
                  select="Main file (.cpp)"/>
            <file condition="C Lib"
                  category="source"
                  name="samc20n/templates/library.c"
                  attr="template"
                  select="Main file (.c)"/>
            <file condition="C Lib"
                  category="source"
                  name="samc20n/templates/library.cpp"
                  attr="template"
                  select="Main file (.cpp)"/>
            <file condition="GCC Exe"
                  category="source"
                  name="samc20n/gcc/system_samc20.c"
                  attr="config"/>
            <file condition="GCC Exe"
                  category="source"
                  name="samc20n/gcc/gcc/startup_samc20.c"
                  attr="config"/>
            <file condition="GCC Exe"
                  category="linkerScript"
                  name="samc20n/gcc/gcc/samc20n17a_flash.ld"
                  attr="config"/>
            <file condition="GCC Exe"
                  category="other"
                  name="samc20n/gcc/gcc/samc20n17a_sram.ld"
                  attr="config"/>
            <file condition="IAR Exe"
                  category="source"
                  name="samc20n/iar/system_samc20.c"
                  attr="config"/>
            <file condition="IAR Exe"
                  category="source"
                  name="samc20n/iar/iar/startup_samc20.c"
                  attr="config"/>
            <file condition="IAR Exe"
                  category="linkerScript"
                  name="samc20n/iar/iar/samc20n17a_flash.icf"
                  attr="config"/>
            <file condition="IAR Exe"
                  category="other"
                  name="samc20n/iar/iar/samc20n17a_sram.icf"
                  attr="config"/>
         </files>
      </component>
      <component Cvendor="Atmel"
                 Cclass="Device"
                 Cgroup="Startup"
                 Cversion="1.1.0"
                 condition="ATSAMC20E18A">
         <description>Headers and startup code for Atmel ATSAMC20E18A</description>
         <files>
            <file condition="C" category="include" name="samc20/include"/>
            <file condition="C" category="header" name="samc20/include/sam.h"/>
            <file condition="C Exe"
                  category="source"
                  name="samc20/templates/main.c"
                  attr="template"
                  select="Main file (.c)"/>
            <file condition="C Exe"
                  category="source"
                  name="samc20/templates/main.cpp"
                  attr="template"
                  select="Main file (.cpp)"/>
            <file condition="C Lib"
                  category="source"
                  name="samc20/templates/library.c"
                  attr="template"
                  select="Main file (.c)"/>
            <file condition="C Lib"
                  category="source"
                  name="samc20/templates/library.cpp"
                  attr="template"
                  select="Main file (.cpp)"/>
            <file condition="GCC Exe"
                  category="source"
                  name="samc20/gcc/system_samc20.c"
                  attr="config"/>
            <file condition="GCC Exe"
                  category="source"
                  name="samc20/gcc/gcc/startup_samc20.c"
                  attr="config"/>
            <file condition="GCC Exe"
                  category="linkerScript"
                  name="samc20/gcc/gcc/samc20e18a_flash.ld"
                  attr="config"/>
            <file condition="GCC Exe"
                  category="other"
                  name="samc20/gcc/gcc/samc20e18a_sram.ld"
                  attr="config"/>
            <file condition="ARMCC Exe"
                  category="source"
                  name="samc20/armcc/Device/SAMC20/Source/ARM/startup_SAMC20.s"
                  attr="config"/>
            <file condition="ARMCC Exe"
                  category="source"
                  name="samc20/armcc/Device/SAMC20/Source/system_samc20.c"
                  attr="config"/>
            <file condition="IAR Exe"
                  category="source"
                  name="samc20/iar/system_samc20.c"
                  attr="config"/>
            <file condition="IAR Exe"
                  category="source"
                  name="samc20/iar/iar/startup_samc20.c"
                  attr="config"/>
            <file condition="IAR Exe"
                  category="linkerScript"
                  name="samc20/iar/iar/samc20e18a_flash.icf"
                  attr="config"/>
            <file condition="IAR Exe"
                  category="other"
                  name="samc20/iar/iar/samc20e18a_sram.icf"
                  attr="config"/>
         </files>
      </component>
      <component Cvendor="Atmel"
                 Cclass="Device"
                 Cgroup="Startup"
                 Cversion="1.1.0"
                 condition="ATSAMC20E17A">
         <description>Headers and startup code for Atmel ATSAMC20E17A</description>
         <files>
            <file condition="C" category="include" name="samc20/include"/>
            <file condition="C" category="header" name="samc20/include/sam.h"/>
            <file condition="C Exe"
                  category="source"
                  name="samc20/templates/main.c"
                  attr="template"
                  select="Main file (.c)"/>
            <file condition="C Exe"
                  category="source"
                  name="samc20/templates/main.cpp"
                  attr="template"
                  select="Main file (.cpp)"/>
            <file condition="C Lib"
                  category="source"
                  name="samc20/templates/library.c"
                  attr="template"
                  select="Main file (.c)"/>
            <file condition="C Lib"
                  category="source"
                  name="samc20/templates/library.cpp"
                  attr="template"
                  select="Main file (.cpp)"/>
            <file condition="GCC Exe"
                  category="source"
                  name="samc20/gcc/system_samc20.c"
                  attr="config"/>
            <file condition="GCC Exe"
                  category="source"
                  name="samc20/gcc/gcc/startup_samc20.c"
                  attr="config"/>
            <file condition="GCC Exe"
                  category="linkerScript"
                  name="samc20/gcc/gcc/samc20e17a_flash.ld"
                  attr="config"/>
            <file condition="GCC Exe"
                  category="other"
                  name="samc20/gcc/gcc/samc20e17a_sram.ld"
                  attr="config"/>
            <file condition="ARMCC Exe"
                  category="source"
                  name="samc20/armcc/Device/SAMC20/Source/ARM/startup_SAMC20.s"
                  attr="config"/>
            <file condition="ARMCC Exe"
                  category="source"
                  name="samc20/armcc/Device/SAMC20/Source/system_samc20.c"
                  attr="config"/>
            <file condition="IAR Exe"
                  category="source"
                  name="samc20/iar/system_samc20.c"
                  attr="config"/>
            <file condition="IAR Exe"
                  category="source"
                  name="samc20/iar/iar/startup_samc20.c"
                  attr="config"/>
            <file condition="IAR Exe"
                  category="linkerScript"
                  name="samc20/iar/iar/samc20e17a_flash.icf"
                  attr="config"/>
            <file condition="IAR Exe"
                  category="other"
                  name="samc20/iar/iar/samc20e17a_sram.icf"
                  attr="config"/>
         </files>
      </component>
      <component Cvendor="Atmel"
                 Cclass="Device"
                 Cgroup="Startup"
                 Cversion="1.1.0"
                 condition="ATSAMC20E15A">
         <description>Headers and startup code for Atmel ATSAMC20E15A</description>
         <files>
            <file condition="C" category="include" name="samc20/include"/>
            <file condition="C" category="header" name="samc20/include/sam.h"/>
            <file condition="C Exe"
                  category="source"
                  name="samc20/templates/main.c"
                  attr="template"
                  select="Main file (.c)"/>
            <file condition="C Exe"
                  category="source"
                  name="samc20/templates/main.cpp"
                  attr="template"
                  select="Main file (.cpp)"/>
            <file condition="C Lib"
                  category="source"
                  name="samc20/templates/library.c"
                  attr="template"
                  select="Main file (.c)"/>
            <file condition="C Lib"
                  category="source"
                  name="samc20/templates/library.cpp"
                  attr="template"
                  select="Main file (.cpp)"/>
            <file condition="GCC Exe"
                  category="source"
                  name="samc20/gcc/system_samc20.c"
                  attr="config"/>
            <file condition="GCC Exe"
                  category="source"
                  name="samc20/gcc/gcc/startup_samc20.c"
                  attr="config"/>
            <file condition="GCC Exe"
                  category="linkerScript"
                  name="samc20/gcc/gcc/samc20e15a_flash.ld"
                  attr="config"/>
            <file condition="GCC Exe"
                  category="other"
                  name="samc20/gcc/gcc/samc20e15a_sram.ld"
                  attr="config"/>
            <file condition="ARMCC Exe"
                  category="source"
                  name="samc20/armcc/Device/SAMC20/Source/ARM/startup_SAMC20.s"
                  attr="config"/>
            <file condition="ARMCC Exe"
                  category="source"
                  name="samc20/armcc/Device/SAMC20/Source/system_samc20.c"
                  attr="config"/>
            <file condition="IAR Exe"
                  category="source"
                  name="samc20/iar/system_samc20.c"
                  attr="config"/>
            <file condition="IAR Exe"
                  category="source"
                  name="samc20/iar/iar/startup_samc20.c"
                  attr="config"/>
            <file condition="IAR Exe"
                  category="linkerScript"
                  name="samc20/iar/iar/samc20e15a_flash.icf"
                  attr="config"/>
            <file condition="IAR Exe"
                  category="other"
                  name="samc20/iar/iar/samc20e15a_sram.icf"
                  attr="config"/>
         </files>
      </component>
